[LWR_VindicatorFocus X2AbilityTemplate]
LocFriendlyName="Vindicator Focus"
LocFlyOverText=Vindicator Focus"
LocLongDescription="Gain Focus during missions, increasing stats, damage, ability effectiveness and allowing them to use powerful abilities. Focus can be gained by hitting enemies."
LocHelpText="Gain Focus during missions, increasing stats, damage, ability effectiveness and allowing them to use powerful abilities. Focus can be gained by hitting enemies."
LocPromotionPopupText="<Bullet/> Vindicators manage their abilities by using focus. Unlike Templars, Vindicators gain focus from hitting enemies. Effectively managing Focus to get the most out of the stat boosts and each ability is critical to using a Templar.<br/><Bullet/> Focus is gained by killing enemies with Rend.<br/><Bullet/> Focus Level 1: Rend Damage +<Ability:FOCUS1RENDDAMAGE/>, Mobility +<Ability:FOCUS1MOBILITY/>, Dodge +<Ability:FOCUS1DODGE/><br/><Bullet/> Focus Level 2: Rend Damage +<Ability:FOCUS2RENDDAMAGE/>, Mobility +<Ability:FOCUS2MOBILITY/>, Dodge +<Ability:FOCUS2DODGE/><br/><Bullet/> Focus Level 3: Rend Damage +<Ability:FOCUS3RENDDAMAGE/>, Mobility +<Ability:FOCUS3MOBILITY/>, Dodge +<Ability:FOCUS3DODGE/><br/><br/><Bullet/> Focus Level 4: Rend Damage +<Ability:FOCUS4RENDDAMAGE/>, Mobility +<Ability:FOCUS4MOBILITY/>, Dodge +<Ability:FOCUS4DODGE/><br/>"

[FocusOnHit X2AbilityTemplate]
LocFriendlyName="Focus on hit"
LocFlyOverText="Focus on hit"
LocLongDescription="Your melee abilities grant you focus when you hit enemy."
LocHelpText="Your melee abilities grant you focus when you hit enemy."
LocPromotionPopupText="<Bullet/>Your melee abilities grant you focus when you hit enemy.<br/>"

[LWR_StoneForm X2AbilityTemplate]
LocFriendlyName="Psi Shield"
LocFlyOverText="Psi Shield"
LocLongDescription="You cast a personal psi shield, gaining shield hp based on current focus and psiamp tech level."
LocHelpText="You cast a personal psi shield, gaining shield hp based on current focus and psiamp tech level."
LocPromotionPopupText="<Bullet/> You cast a personal psi shield, gaining shield hp.<br/><Bullet/>The HP amount is based on current focus and psi amp tech level.<br/><Bullet/>You gain a one turn mobility penalty.<br/><Bullet/>The effect lasta 3 turns and cannot be stacked.<br/><Bullet/>This ability costs 2 focus.<br/>"

[LWR_IronSkin X2AbilityTemplate]
LocFriendlyName="Ironskin"
LocFlyOverText="Ironskin"
LocLongDescription="Your psi shield gains new ability that has a chance to reduce upcoming hits."
LocHelpText="Your psi shield gains new ability that has a chance to reduce upcoming hits."
LocPromotionPopupText="<Bullet/> When Psi Shield is active, you have a chance to downgrade hits (e.g crit->hit) based on the current focus. <br/>"

[LWR_MindShield X2AbilityTemplate]
LocFriendlyName="Mindshield"
LocFlyOverText="Mindshield"
LocLongDescription="Your training have given you protection from attacks against mind."
LocHelpText=Your training have given you protection from attacks against mind."
LocPromotionPopupText="<Bullet/>You gain the effects of a mindshield, you are immune to panic, disorient and stun. You also gain +15 will.<br/>"

[LWR_ThousandCuts X2AbilityTemplate]
LocFriendlyName="Thousand cuts"
LocFlyOverText="Thousand cuts"
LocLongDescription="You are allowed to make new lesser strike with your momentum."
LocHelpText="You are allowed to make new lesser strike with your momentum."
LocPromotionPopupText="<Bullet/> You can use your momentum for a new strike using focus.<br/><Bullet/> This attack has it's damage reduced by 50% and gives you a mobility penalty.<br/><Bullet/>This can be used multiple times in a turn if you have focus and mobility to use it.<br/>"

[LWR_ThousandCut_Activated X2AbilityTemplate]
LocFriendlyName="Thousand cuts"
LocFlyOverText="Thousand cuts"
LocLongDescription="You are allowed to make new lesser strike with your momentum."
LocHelpText="You are allowed to make new lesser strike with your momentum."
LocPromotionPopupText="<Bullet/> You can use your momentum for a new strike using focus.<br/><Bullet/> This attack has it's damage reduced by 50% and gives you a mobility penalty.<br/><Bullet/>This can be used multiple times in a turn if you have focus and mobility to use it.<br/>"

[LWR_Preparation X2AbilityTemplate]
LocFriendlyName="Preparation"
LocFlyOverText="Preparation"
LocLongDescription="Preparation allows you to use your momentum to gain focus."
LocHelpText="Preparation allows you to use your momentum to gain focus."
LocPromotionPopupText="<Bullet/>Preparation allows you to use your momentum to gain 2 focus. It can also be used with standard action.<br/>"

[VindicatorFleche X2AbilityTemplate]
LocFriendlyName="Vindicator Fleche"
LocFlyOverText="Vindicator Fleche"
LocLongDescription="Gives damage boost to your melee abilities based on the tiles between starting position and the target."
LocHelpText="Gives damage boost to your melee abilities based on the tiles between starting position and the target."
LocPromotionPopupText="<Bullet/>Gives damage boost to your melee abilities based on the tiles between starting position and the target.<br/>"

[LWR_Rend X2AbilityTemplate]
LocFriendlyName="Vindicator Rend"
LocLongDescription="Melee attack, which triggers Momentum, and generates Focus on hits."
LocHelpText="Melee attack, which triggers Momentum, and generates Focus on hits."
LocPromotionPopupText="<Bullet/> Rend can generate focus with hits.<br/><Bullet/> Rend's damage is increased at higher Focus levels.<br/><Bullet/> After casting Rend, the Vindicator will gain Momentum, allowing them one movement action. Use this to return to cover after attacking.<br/>"

[LWR_ArcWave X2AbilityTemplate]
LocFriendlyName="Vindicator Rend"
LocLongDescription="Melee attack, which triggers Momentum, and generates Focus on hits."
LocHelpText="Melee attack, which triggers Momentum, and generates Focus on hits."
LocPromotionPopupText="<Bullet/> Rend can generate focus with hits.<br/><Bullet/> Rend's damage is increased at higher Focus levels.<br/><Bullet/> After casting Rend, the Vindicator will gain Momentum, allowing them one movement action. Use this to return to cover after attacking.<br/>"

[LWR_ArcWavePassive X2AbilityTemplate]
LocFriendlyName="Arc Wave"
LocLongDescription="Melee attack, which triggers Momentum, and generates Focus on hits."
LocHelpText="Melee attack, which triggers Momentum, and generates Focus on hits."
LocPromotionPopupText="<Bullet/> Arc Wave does not affect the target of the original Rend attack.<br/><Bullet/> Arc Wave deals damage equal to double the Templar's current Focus level, or 1 if they have no Focus.<br/><Bullet/> Arc Wave travels through environmental objects.<br/>"

[LWR_Exchange X2AbilityTemplate]
LocFriendlyName="Swap"
LocFlyOverText="Swap"
LocLongDescription="You may swap locations with enemy or friendly unit."
LocHelpText="You may swap locations with enemy or friendly unit."
LocPromotionPopupText="<Bullet/>Combines Templars invert&exchange to one ability, using psi powers to swap location with enemy or friendly unit.<br/>"

[LWR_Enrage X2AbilityTemplate]
LocFriendlyName="Zeal"
LocFlyOverText="Zeal"
LocLongDescription="You enter a furious zeal for two turns, giving you a damage boost, but lowreing your defense. While this is active, you also gain focus when being targeted by enemies."
LocHelpText="You enter a furious zeal for two turns, giving you a damage boost, but lowreing your defense. While this is active, you also gain focus when being targeted by enemies."
LocPromotionPopupText="<Bullet/>All your attacks gain 25% damage boost for two turns.<br/><Bullet/> Your defense is lowered by -20.<br/><Bullet/> When you are targeted by enemy abilities, you cain focus and lower the cooldown of the ability.<br/>"

[LWR_Enrage_Passive X2AbilityTemplate]
LocFriendlyName="Zeal"
LocFlyOverText="Zeal"
LocLongDescription="You enter a furious zeal for two turns, giving you a damage boost, but lowreing your defense. While this is active, you also gain focus when being targeted by enemies."
LocHelpText="You enter a furious zeal for two turns, giving you a damage boost, but lowreing your defense. While this is active, you also gain focus when being targeted by enemies."
LocPromotionPopupText="<Bullet/>All your attacks gain 25% damage boost for two turns.<br/><Bullet/> Your defense is lowered by -20.<br/><Bullet/> When you are targeted by enemy abilities, you cain focus and lower the cooldown of the ability.<br/>"

[LWR_Judgement X2AbilityTemplate]
LocFriendlyName="Vindicators Judgement"
LocFlyOverText="Vindicators Judgement"
LocLongDescription="When you are being targeted by enemy, you react with casting a psi spell that tries to panic them."
LocHelpText="When you are being targeted by enemy, you react with casting a psi spell that tries to panic them."
LocPromotionPopupText="<Bullet/>Similar to Skirmishers Judgement, but instead uses the Vindicators psi offense/2 versus enemy will.<br/>"

[LWR_JudgmentTrigger X2AbilityTemplate]
LocFriendlyName="Vindicators Judgement"
LocFlyOverText="Vindicators Judgement"
LocLongDescription="When you are being targeted by enemy, you react with casting a psi spell that tries to panic them."
LocHelpText="When you are being targeted by enemy, you react with casting a psi spell that tries to panic them."
LocPromotionPopupText="<Bullet/>Similar to Skirmishers Judgement, but instead uses the Vindicators psi offense/2 versus enemy will.<br/>"

[LWR_Vigor X2AbilityTemplate]
LocFriendlyName="Vigor"
LocFlyOverText="Vigor"
LocLongDescription="Gain critical hit chance&damage based on each point of focus."
LocHelpText="Gain critical hit chance&damage based on each point of focus."
LocPromotionPopupText="<Bullet/>Your primary weapon gains critical hit chance and critical damage based on the current focus. Passive.<br/>"

[LWR_CriticalFocus X2AbilityTemplate]
LocFriendlyName="Critical Focus"
LocFlyOverText="Critical Focus"
LocLongDescription="You gain two focus when you critically strike enemy."
LocHelpText="You gain two focus when you critically strike enemy."
LocPromotionPopupText="<Bullet/>You gain two focus when you critically strike enemy.<br/>"


[LWR_Soulfire X2AbilityTemplate]
LocFriendlyName="Soulfire"
LocLongDescription="Does guaranteed Psionic damage to an organic enemy. Ignores cover and armor."
LocHelpText="Does guaranteed Psionic damage to an organic enemy. Ignores cover and armor."
LocFlyOverText="Soulfire"
LocPromotionPopupText="<Bullet/> Soulfire has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> The damage done by the Soulfire ability can be increased by upgrading the Psi Operative's Psi Amp.<br/><Bullet/> Robotic and mechanical enemies are completely immune to Soulfire.<br/><Bullet/> This ability costs 1 focus to cast.<br/>"

[LWR_Stasis X2AbilityTemplate]
LocFriendlyName="Stasis"
LocLongDescription="Completely stuns the target for 1 turn, but renders them immune to any damage or attack."
LocHelpText="Completely stuns the target for 1 turn, but renders them immune to any damage or attack."
LocFlyOverText="Stasis"
LocPromotionPopupText="<Bullet/> Stasis has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> As Stasis completely removes an enemy unit from combat for a turn, it can be used defensively to protect vulnerable soldiers, or it can be used offensively to set up a coordinated attack.<br/><Bullet/> This ability costs 2 focus to cast.<br/>"

[LWR_Insanity X2AbilityTemplate]
LocFriendlyName="Insanity"
LocLongDescription="Debilitating telepathic attack that can inflict different negative conditions, including mental control of the target."
LocHelpText="Debilitating telepathic attack that can inflict different negative conditions, including mental control of the target."
LocFlyOverText="Insanity"
LocMissMessage="Insanity Failed"
LocPromotionPopupText="<Bullet/> Insanity has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Insanity requires a contest between the Psi Operative's Psi Strength stat, and the target's will.<br/><Bullet/> Insanity can disorient, stun, or mind control the target if it succeeds.<br/><Bullet/> Mechanical enemies are completely immune to Insanity.<br/><Bullet/> This ability costs 1 focus to cast.<br/>"

[LWR_Fuse X2AbilityTemplate]
LocFriendlyName="Fuse"
LocLongDescription="If an enemy is carrying explosives, they can be remotely detonated by the Psi Operative."
LocHelpText="If an enemy is carrying explosives, they can be remotely detonated by the Psi Operative."
LocFlyOverText="Fuse"
LocPromotionPopupText="<Bullet/> Fuse has no cooldown.<br/><Bullet/> This ability costs 1 focus to cast.<br/>"

[LWR_Domination X2AbilityTemplate]
LocFriendlyName="Domination"
LocLongDescription="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocHelpText="Permanently mind control an enemy. Only one successful Domination can be performed per mission."
LocFlyOverText="Domination"
LocMissMessage="Domination Failed"
LocPromotionPopupText="<Bullet/> Domination requires a contest of the Psi Operative's Psi Strength stat versus the Will of the target.<br/><Bullet/> If an attempted Domination fails, there is a 4 turn cooldown before another Domination can be attempted.<br/><Bullet/> If the Psi Operative dies or leaves the battlefield, the Domination is broken.<br/><Bullet/> This ability costs 4 focus to cast.<br/>"

[LWR_NullLance X2AbilityTemplate]
LocFriendlyName="Null Lance"
LocLongDescription="Project a beam of terrible power that damages every target it passes through. This attack can penetrate multiple enemies and obstacles."
LocHelpText="Project a beam of Psionic energy that damages every target it passes through."
LocFlyOverText="Null Lance"
LocPromotionPopupText="<Bullet/> Null Lance has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Null Lance damage can be increased by improving the Psi Operative's Psi Amp.<br/><Bullet/> This ability costs 3 focus to cast.<br/>"

[LWR_VoidRift X2AbilityTemplate]
LocFriendlyName="Void Rift"
LocLongDescription="Generate an explosive field of Psionic energy that immediately damages everything within. Organic enemies have a chance to suffer Insanity."
LocHelpText="Generate an explosive field of Psionic energy that damages everything within. Organic enemies have a chance to suffer Insanity."
LocFlyOverText="Void Rift"
LocPromotionPopupText="<Bullet/> Void Rift has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> This ability costs 4 focus to cast.<br/>"

[LWR_NullWard X2AbilityTemplate]
LocFriendlyName="Null Ward"
LocLongDescription="Project psionic shields around the soldier and nearby allies. The shields will collapse if this soldier is killed."
LocHelpText="Project psionic shields around nearby allies and yourself."
LocFlyOverText="Null Ward"
LocPromotionPopupText="<Bullet> Project psionic shields around the soldier and nearby allies. The shields will collapse if this soldier is killed.<br/><Bullet/> Null Ward grants <Ability:NULL_WARD_BASE_SHIELD> ablative hit points.<br/><Bullet/> Improved Psi Amps grant additional bonuses to ablative hit points.<br/><Bullet/> Null Ward requires one action and does not end your turn.<br/><Bullet/> Null Ward has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Null Ward has a radius of 8 tiles.<br/><Bullet/> Null Ward costs 2 focus to cast.<br/>"

[LWR_PhaseWalk X2AbilityTemplate]
LocFriendlyName="Phase Walk"
LocLongDescription="Temporarily phase out of existence to teleport to a nearby location."
LocHelpText="Temporarily phase out of existence to teleport to a nearby location."
LocFlyOverText="Phase Walk"
LocPromotionPopupText="<Bullet> Temporarily phase out of existence to teleport to a nearby location.<br/><Bullet/> The targeted tile must be visible (works with squadsight).<br/><Bullet/> Phase Walk requires one action and does not end your turn.<br/><Bullet/> Phase Walk has a <Ability:SelfCooldown_LW/> turn cooldown.<br/><Bullet/> Phase Walk has a radius of <Ability:PHASEWALK_CAST_RANGE_TILES> tiles.<br/><Bullet/> Moving with Phase Walk can trigger certain reaction fire abilities.<br><Bullet/> Phasewalk costs 1 focus to cast.<br>"


[LWR_Vindicator X2SoldierClassTemplate]
DisplayName="Vindicator"
ClassSummary="Vindicators are exiled Templars, who were forced out of the organization. According to Templars, the Vindicators started experimenting with ADVENT research to enchance their psychic abilities. Vindicators are ready to pay any price to save Earth from the ADVENT. They can use psychic powers to buff their melee abilities or to launch powerful spells."
LeftAbilityTreeTitle="Vindicator"
RightAbilityTreeTitle="Warlock"

AbilityTreeTitles[0]="Zealot"
AbilityTreeTitles[1]="Wraith"
AbilityTreeTitles[2]="Warlock"
AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
RandomNickNames[0]="Ether"
RandomNickNames[1]="Shock"
RandomNickNames[2]="Scorch"
RandomNickNames[3]="Fury"
RandomNickNames[4]="Storm"
RandomNickNames[5]="Volt"
RandomNickNames[6]="Warden"
RandomNickNames[7]="Scorch"
RandomNickNames[8]="Prophet"
RandomNickNames[9]="Stormwalker"
RandomNickNames[10]="Mystic"
RandomNickNames[11]="Magister"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Warlock"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Witch"
PhotoboothSoloBLines_Male[0]="His Deadliest Weapon... Is His Mind!"
PhotoboothSoloBLines_Male[1]="Strength Through Sacrifice"
PhotoboothSoloBLines_Male[2]="Nature Bows to His Will. So shall ADVENT!"
PhotoboothSoloBLines_Male[3]="Space and Time At His Command!"
PhotoboothSoloBLines_Male[4]="If He Is With Us, Who Can Stand Against Us?"
PhotoboothSoloBLines_Male[5]="Like the Laws of Nature, ADVENT Will BREAK!"
PhotoboothSoloBLines_Male[6]="A Storm is Coming."
PhotoboothSoloBLines_Male[7]="\"I do not fear the storm.  I am the storm.\""
PhotoboothSoloBLines_Male[8]="If the ADVENT have gods, then it's time to pray."
PhotoboothSoloBLines_Male[9]="Feel his POWER."

PhotoboothSoloBLines_Female[0]="Her Deadliest Weapon... Is Her Mind!"
PhotoboothSoloBLines_Female[1]="Strength Through Sacrifice"
PhotoboothSoloBLines_Female[2]="Nature Bows to Her WIll.  So shall ADVENT!"
PhotoboothSoloBLines_Female[3]="Space and Time At Her Command!"
PhotoboothSoloBLines_Female[4]="If She Is With Us, Who Can Stand Against Us?"
PhotoboothSoloBLines_Female[5]="Like the Laws of Nature, ADVENT Will BREAK!"
PhotoboothSoloBLines_Female[6]="A Storm is Coming."
PhotoboothSoloBLines_Female[7]="\"I do not fear the storm.  I am the storm.\""
PhotoboothSoloBLines_Female[8]="If the ADVENT have gods, then it's time to pray."
PhotoboothSoloBLines_Female[9]="Feel her POWER."

